<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"21bff89a573b973de4f54ca26eb138bed382eda9c3a52473426b64a555d12f4f","plan_job_ref":"Job TF Plan #7 at https://github.com/AFMPE/AMPE_SWA_TF/actions/runs/4687378390","plan_hash":"dd7a0fe3313ec57aaa457463f33a73b80b2db0f4d83f08276955e90898088867","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `resource_group_name=ampe-eastus2-network-artifacts-dev-rg
storage_account_name=ampetfstatesajcjvdiwg
container_name=ampetfdevscjcjvdiwg
key=terraform.state`
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_dns_cname_record.cname will be created
  + resource "azurerm_dns_cname_record" "cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = (known after apply)
      + resource_group_name = "ampe-eastus2-remote-test-dev-rg"
      + ttl                 = 300
      + zone_name           = "missionpartners.us"
    }

  # azurerm_static_site.staticapp will be created
  + resource "azurerm_static_site" "staticapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "AMPE-Static-Page"
      + resource_group_name = "ampe-eastus2-remote-test-dev-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
    }

  # azurerm_static_site_custom_domain.name will be created
  + resource "azurerm_static_site_custom_domain" "name" {
      + domain_name      = "www.missionpartners.us"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "cname-delegation"
    }

  # module.static-web-app.azurerm_resource_group.main_rg will be created
  + resource "azurerm_resource_group" "main_rg" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "ampe-eastus2-remote-test-dev-rg"
      + tags     = {
          + "Environment" = "Development"
          + "Project"     = "StaticWebApp"
          + "Terraform"   = "true"
          + "env"         = "dev"
          + "workload"    = "remote-test"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [TF Plan #7](https://github.com/AFMPE/AMPE_SWA_TF/actions/runs/4687378390)